package lark_sdk

import (
	"context"
	"testing"

	"github.com/YueY4n9/gotools/echo"
)

func newClient() *LarkClient {
	return NewClient("cli_a6b488d797f8500c", "d91mgv3S0ZBVu0IKpX5vGfkiHWMACAkV")
}

func TestNewClient(t *testing.T) {
	newClient()
}

func TestLarkClient_GetUserByUserId(t *testing.T) {
	c := newClient()
	userInfo, err := c.GetUserByUserId(context.Background(), "3291738c")
	if err != nil {
		t.Fatal(err)
	}
	echo.Json(userInfo)
}

func TestLarkClient_GetEmployeeByUserId(t *testing.T) {
	c := newClient()
	employee, err := c.GetEmpByUserId(context.Background(), "2f1ge56g")
	if err != nil {
		t.Fatal(err)
	}
	echo.Json(employee)
}

func TestLarkClient_GetAttachment(t *testing.T) {
	c := newClient()
	err := c.GetAttachment(context.Background(), "WuMQb619foEUlVxgQNQcxzd8nAe")
	if err != nil {
		t.Fatal(err)
	}
}

//func TestLarkClient_GetDepartmentManagerByDfs(t *testing.T) {
//	c := newClient()
//	managerByDfs, err := c.GetDepartmentManagerByDfs(context.Background(), "3291738c")
//	if err != nil {
//		t.Fatal(err)
//	}
//	echo.Json(managerByDfs)
//}

//func TestLarkClient_ListUserByDepartmentId(t *testing.T) {
//	c := newClient()
//	deptIds := []string{"f584acfcee939abf", "19f86abeg64cd7c3", "5bgcf6577f87522f", "d3fgd2ca1418a4eb", "b365a5d1cb5b69a2", "a58bbgg9g63agcg1"}
//	res := make([]string, 0)
//	for _, dept := range deptIds {
//		userIds, err := c.ListUserByDepartmentId(context.Background(), dept)
//		if err != nil {
//			t.Fatal(err)
//		}
//		res = append(res, userIds...)
//	}
//	res = _slice.RemoveDuplication(res)
//	echo.Json(res)
//}

//func TestLarkClient_GetUsersByDepartmentId(t *testing.T) {
//	c := newClient()
//	departmentMap, _ := c.GetChildDepartmentMap(context.Background(), "d4e276efc6ac5fee")
//	users, _ := c.GetUsersByDeptId(context.Background(), "d4e276efc6ac5fee")
//	fmt.Println(len(users))
//	m := make(map[string]string)
//	for _, user := range users {
//		m[*user.Name] = user.DepartmentIds[0]
//	}
//	str := "丁开元:192.168.50.52\n丁可卉:192.168.50.90\n丁呈懿:192.168.40.84\n丁昌森:192.168.70.124\n丁灿林:192.168.70.24\n丁鑫磊:192.168.40.17\n丁钦:192.168.40.15\n万浩林:192.168.50.62\n严丰:192.168.40.36\n严润秋:192.168.50.188\n乔议丹:192.168.70.158\n于嘉斌:192.168.50.64\n于紫晶:192.168.50.27\n云rodc:10.100.96.13\n仇敏婕:192.168.51.4\n付利华:192.168.70.162\n仝旭东:192.168.50.17\n仲珊珊:192.168.50.101\n仲秉霖:192.168.40.127\n任紫微:192.168.70.198\n任翔:192.168.70.70\n何佳俊:192.168.70.34\n何佳兴:192.168.40.44\n何琪:192.168.70.175\n余亨:192.168.50.6\n余本超:192.168.70.127\n余祥伟:192.168.40.152\n余蕾:192.168.50.19\n信长青:192.168.40.4\n兰亮:192.168.70.98\n兰翔:192.168.70.196\n冀轶男:192.168.40.170\n冯笑:192.168.50.95\n冯琳:192.168.50.47\n凌馨:192.168.70.61\n刘以兵:192.168.70.161\n刘垚:192.168.40.40\n刘威:192.168.70.56\n刘宇阳:192.168.40.78\n刘峻池:192.168.70.170\n刘梓秋:192.168.40.156\n刘浩男:192.168.40.85\n刘滔:192.168.50.86\n刘焱:192.168.70.152\n刘磊:192.168.50.232\n刘翼:192.168.70.39\n刘莹:192.168.40.13\n刘诗云:192.168.40.112\n刘金:192.168.50.74\n刘鑫:192.168.50.96\n卞世纪:192.168.70.65\n卢佳鑫:192.168.70.75\n卢静:192.168.50.110\n史罗琼:192.168.70.80\n叶丹:192.168.70.181\n叶子剑:192.168.70.50\n吉彭泽:192.168.40.143\n吉雅晶:192.168.40.126\n向钉胜:192.168.70.148\n吕倩倩:192.168.40.135\n吕岳:192.168.40.124\n吴之涛:192.168.70.211\n吴佳黛:192.168.40.93\n吴其定:192.168.70.25\n吴凡:192.168.70.55\n吴名川:192.168.40.46\n吴小金:192.168.70.48\n吴忆雯:192.168.50.58\n吴文俊:192.168.70.177\n吴昕璇:192.168.50.148\n吴炎鹏:192.168.40.121\n吴珮珊:192.168.40.101\n吴端婷:192.168.70.120\n吴继云:192.168.70.147\n吴飞:192.168.20.18\n周大安:192.168.40.76\n周尧:192.168.70.157\n周德成:192.168.40.56\n周文俊:192.168.50.63\n周漪君:192.168.70.85\n周瑞聪:192.168.40.37\n周行:192.168.50.79\n周金文:192.168.70.132\n咸舒莹:192.168.40.67\n唐晓强:192.168.70.111\n唐涛:192.168.70.220\n唐绪琦:192.168.70.165\n唐雨森:192.168.40.25\n唐鹏:192.168.70.74\n商宏荣:192.168.70.76\n圣艾婧:192.168.70.62\n夏威宇:192.168.50.80\n夏小雯:192.168.50.248\n夏雨生:192.168.70.97\n奚圣来:192.168.70.146\n姚加:192.168.70.119\n姚文俊:192.168.40.58\n姜杰宏:192.168.70.66\n姜楷:192.168.70.153\n孔德天:192.168.40.43\n孙佳龙:192.168.70.123\n孙向宇:192.168.51.21\n孙志杰:192.168.40.18\n孟斌:192.168.40.119\n孟春:192.168.50.24\n宋佳亮:192.168.70.135\n宋歌:192.168.70.185\n尹兆今:192.168.70.30\n尹宏元:192.168.50.25\n岳杨:192.168.20.19\n崔梦杨:192.168.20.25\n崔琪:192.168.70.221\n崔英健:192.168.40.68\n康周洲:192.168.40.10\n康睿:192.168.51.1\n廖子月:192.168.40.80\n张一帆:192.168.70.163\n张乐:192.168.50.85\n张佳雯:192.168.70.44\n张凯:192.168.40.64\n张凯钧:192.168.70.151\n张友珽:192.168.50.56\n张威:192.168.50.199\n张子阳:192.168.50.43\n张思思:192.168.70.189\n张昕宇:192.168.50.93\n张昱滢:192.168.70.205\n张晨:192.168.40.92\n张晨1:192.168.70.176\n张玉鹏:192.168.70.73\n张璐:192.168.40.61\n张睿杰:192.168.70.202\n张程:192.168.70.219\n张胜杨:192.168.70.136\n张芳略:192.168.40.29\n张金涛:192.168.70.47\n张鹏:192.168.50.46\n彭中军:192.168.70.156\n彭国安:192.168.70.82\n彭正:192.168.40.106\n彭涛:192.168.50.22\n彭译萱:192.168.50.34\n徐嘉静:192.168.70.169\n徐晋柏:192.168.70.215\n徐炜杰:192.168.70.109\n徐笑嫣然:192.168.40.11\n徐骞:192.168.50.143\n戴学龙:192.168.70.45\n戴宇威:192.168.40.116\n戴安家:192.168.40.120\n戴高乐:192.168.70.167\n掌建军:192.168.40.33\n文宇琪:192.168.40.70\n方强:192.168.70.116\n施易辰:192.168.40.111\n景子翔:192.168.50.33\n曹权亮:192.168.70.180\n曾亮:192.168.70.129\n曾俊:192.168.70.33\n曾树楷:192.168.40.55\n朱书铵:192.168.70.19\n朱勇:192.168.50.59\n朱熠烽:192.168.70.21\n李伟强:192.168.70.31\n李俊日:192.168.40.164\n李嘉成:192.168.70.139\n李国炜:192.168.70.103\n李媛:192.168.70.208\n李子楠:192.168.70.52\n李宇君:192.168.50.72\n李恪非:192.168.40.54\n李政锟:192.168.70.35\n李林:192.168.50.30\n李林杰:192.168.40.42\n李梦海:192.168.70.213\n李楚滢:192.168.40.163\n李涛:192.168.70.86\n李皓龙:192.168.50.39\n李红玉:192.168.70.29\n李钊博:192.168.50.40\n李锐威:192.168.40.122\n李鹏远:192.168.40.113\n杜子澍:192.168.40.90\n杜智文:192.168.40.147\n杨卜镔:192.168.70.37\n杨可成:192.168.40.75\n杨家昊:192.168.70.79\n杨帆:192.168.70.36\n杨森:192.168.40.165\n杨瑶:192.168.70.105\n林先锋:192.168.70.93\n林巍:192.168.40.9\n林时锟:192.168.70.26\n林曾鹏:192.168.70.112\n林潇鋆:192.168.50.42\n林烂:192.168.50.88\n林英奎:192.168.50.44\n梁心:192.168.70.118\n梁立雄:192.168.70.144\n段连翔:192.168.50.136\n毛智晟:192.168.70.168\n汤松儒:192.168.70.28\n汪科:192.168.20.12\n汪艳明:192.168.70.96\n沈佳美:192.168.40.7\n沈天豪:192.168.40.47\n沈晓冬:192.168.70.199\n沈阳:192.168.70.104\n海康威视服务端:192.168.211.230\n涂宣平:192.168.40.73\n温海波:192.168.70.57\n潘奇峰:192.168.70.142\n潘扬扬:192.168.40.26\n潘槟:192.168.50.28\n潘陈:192.168.70.107\n潘雪琤:192.168.50.73\n潘霏:192.168.50.89\n潘霏2:192.168.50.69\n熊亦尧:192.168.40.115\n牛永杰:192.168.50.211\n王亚楠:192.168.70.200\n王亮:192.168.40.109\n王亮2:192.168.40.16\n王佩:192.168.70.154\n王佩然:192.168.20.14\n王兆亮:192.168.70.14\n王喆:192.168.40.128\n王子祯:192.168.40.98\n王子龙:192.168.40.79\n王家轩:192.168.40.66\n王小丽:192.168.50.18\n王悦箫:192.168.70.53\n王昱旻:192.168.70.91\n王瑶:192.168.40.146\n王皓:192.168.70.59\n王胜杰:192.168.50.87\n王舒娣:192.168.50.61\n王诗慧:192.168.40.71\n王路瑶:192.168.50.23\n王金涛:192.168.40.192\n王金铭:192.168.70.106\n王鑫:192.168.70.174\n王钊:192.168.40.114\n王镇宇:192.168.40.53\n王骏:192.168.70.110\n田慧:192.168.70.131\n田飞:192.168.70.133\n申佳恒:192.168.70.54\n申桐:192.168.50.123\n程姗杉:192.168.70.117\n程登魁:192.168.40.150\n章浙鹏:192.168.40.110\n竺妍晨:192.168.70.100\n罗思为:192.168.50.8\n罗艳:192.168.50.50\n罗荣达:192.168.50.31\n罗雨欣:192.168.70.114\n翁晓涛:192.168.70.23\n翟思嘉:192.168.70.90\n耿子骏:192.168.70.206\n耿悦悦:192.168.40.31\n聂紫君:192.168.70.41\n聂艳雄:192.168.70.83\n肖伟伟:192.168.40.96\n胡万科:192.168.70.179\n胡中丽:192.168.70.121\n胡佳凡:192.168.40.87\n胡启佳:192.168.40.41\n胡时硕:192.168.70.217\n胡智:192.168.70.125\n胡泊:192.168.50.201\n胡源培:192.168.40.77\n胡诗婕:192.168.70.42\n苏鹏:192.168.50.168\n范宇:192.168.70.102\n莎日娜:192.168.40.57\n葛亮:192.168.40.82\n葛凡钰:192.168.40.83\n葛山村:192.168.70.58\n董世航:192.168.40.151\n董书凡:192.168.70.69\n董翔:192.168.70.71\n董莹莹:192.168.40.6\n蒋款款:192.168.70.51\n蒋波娜:192.168.70.128\n蒋钊玮:192.168.50.192\n蒋雨新:192.168.50.2\n蔡丽雯:192.168.40.3\n蔡哲鑫:192.168.70.63\n蔡姗谷:192.168.50.41\n蔡月婷:192.168.70.130\n蔡超:192.168.70.209\n薛钰:192.168.40.81\n许佳楠:192.168.70.191\n谈慧:192.168.40.168\n谢文康:192.168.50.210\n谢晓聪:192.168.50.21\n谢祖地:192.168.70.43\n谢逸欣:192.168.40.100\n谭延豪:192.168.50.78\n谭智元:192.168.70.38\n贾雯:192.168.50.54\n赵于君:192.168.40.51\n赵国玉:192.168.50.233\n赵帅:192.168.40.104\n赵恒:192.168.70.159\n赵晨安:192.168.40.161\n赵林峰:192.168.70.18\n车善姬:192.168.50.53\n边洁蕊:192.168.70.68\n连麒羽:192.168.40.12\n邓翔宇:192.168.50.13\n邬皓丞:192.168.50.65\n郎东辉:192.168.40.149\n郎宇宁:192.168.70.20\n郑云霞:192.168.40.14\n郑欣瑞:192.168.40.137\n郑珂:192.168.50.104\n郭圣捷:192.168.70.95\n郭宝龙:192.168.70.197\n郭竹筠:192.168.50.5\n郭艺君:192.168.70.89\n钟心怡:192.168.70.149\n钱程浩:192.168.40.117\n闫姗姗:192.168.40.21\n闵鑫灏:192.168.40.34\n陆亿:192.168.40.99\n陈亦玮:192.168.50.37\n陈偲偈:192.168.40.63\n陈偲偈笔记本:192.168.40.32\n陈力菲:192.168.50.32\n陈卓玲:192.168.40.107\n陈宇泷:192.168.70.108\n陈家政:192.168.70.22\n陈建业:192.168.40.94\n陈建业:192.168.40.118\n陈彧:192.168.40.52\n陈春婷:192.168.50.76\n陈智勇:192.168.50.252\n陈朋娇:192.168.20.16\n陈泳椅:192.168.40.155\n陈潇洒:192.168.50.60\n陈焕妍:192.168.70.64\n陈熠卓:192.168.40.22\n陈玲:192.168.40.45\n陈益新:192.168.70.140\n陈颖杰:192.168.70.201\n鞠欣然:192.168.70.78\n韦明娟:192.168.70.101\n韩东兴:192.168.50.48\n韩伟国:192.168.70.218\n韩开艺:192.168.40.142\n韩清:192.168.50.45\n韩裔:192.168.40.28\n顾佳明:192.168.50.91\n顾俊文:192.168.40.20\n顾婷婷:192.168.70.164\n颜泽雪:192.168.40.48\n颜达龙:192.168.70.81\n马一展:192.168.50.75\n马煜航:192.168.40.23\n骆名查:192.168.70.137\n高健飞:192.168.40.88\n魏晓林:192.168.40.65\n麻文波:192.168.70.94\n黄博骏:192.168.50.4\n黄浚达:192.168.70.207\n黄涛:192.168.70.155\n黄雄杰:192.168.40.140\n龚悦:192.168.40.35\n仲金德:192.168.40.133\n何昊:192.168.40.5\n何栋:192.168.70.27\n刘珲:192.168.50.55\n单莹:192.168.50.51\n叶婧雅:192.168.50.3\n叶润周:192.168.40.144\n周保林:192.168.70.113\n唐培君:192.168.70.49\n岑昀玲:192.168.50.171\n崔敏航:192.168.40.59\n崔莹莹:192.168.50.29\n庞志彬:192.168.40.108\n张含:192.168.70.195\n张志伟:192.168.50.70\n张思聪:192.168.50.203\n张鹏辉:192.168.50.67\n徐志林:192.168.40.102\n徐杰:192.168.40.69\n戚子康:192.168.50.227\n李方涛:192.168.70.46\n杨帆1:192.168.70.115\n杨菲:192.168.40.25\n林雨歆:192.168.50.77\n毕松:192.168.20.10\n潘凯群:192.168.70.204\n熊舒捷:192.168.40.39\n牟晨媛:192.168.40.91\n王心言:192.168.40.89\n王梓聪:192.168.50.36\n王楠:192.168.40.132\n石川:192.168.40.139\n章璐:192.168.50.66\n翟羽:192.168.50.35\n胡浩:192.168.40.74\n董璐:192.168.220.107\n蒋明亮:192.168.40.123\n蔡奕欢:192.168.50.12\n贺子菁:192.168.50.102\n赵芸:192.168.70.166\n郝子然:192.168.50.216\n金泰吉:192.168.50.251\n陆晓芸:192.168.237.11\n陈嘉辉:192.168.40.19\n陈晨1:192.168.70.210\n陈瀚冰:192.168.40.145\n陈谷:192.168.50.202\n陈辰:192.168.40.8\n颜艳平:192.168.50.191\n马磊:192.168.50.238\n黄雨龙:192.168.236.221\n龚成:192.168.236.204\n沈伟骏:192.168.70.46\n张宇鑫:192.168.40.138\n金骐:192.168.50.81\n孟炯杰:192.168.50.134\n郑嘉仪:192.168.50.38\n刘川:192.168.70.32\n童思清:192.168.50.71\n邓璟:192.168.40.139"
//	split := strings.Split(str, "\n")
//	ipMap := make(map[string]string)
//	for _, s := range split {
//		split2 := strings.Split(s, ":")
//		ipMap[split2[0]] = split2[1]
//	}
//	res := make([]T, 0)
//	for k, v := range m {
//		if len(ipMap[k]) == 0 {
//			continue
//		}
//		res = append(res, T{
//			Targets: []string{ipMap[k] + ":9182"},
//			Labels: label{
//				Type: "machine",
//				Idc:  "manjuu",
//				Ip:   ipMap[k],
//				Name: k,
//				Dept: v,
//			},
//		})
//	}
//	for i := range res {
//		res[i].Labels.Dept = departmentMap[res[i].Labels.Dept]
//	}
//	sort.Slice(res, func(i, j int) bool {
//		if len(res[i].Targets) == 0 {
//			return true
//		}
//		if len(res[j].Targets) == 0 {
//			return false
//		}
//		return res[i].Targets[0] < res[j].Targets[0]
//	})
//	echo.Json(res)
//	emptyUser := make([]string, 0)
//	for i := range res {
//		if res[i].Labels.Ip == "" {
//			emptyUser = append(emptyUser, res[i].Labels.Name)
//		}
//	}
//	echo.Json(emptyUser)
//}

type T struct {
	Targets []string `json:"targets"`
	Labels  label    `json:"labels"`
}

type label struct {
	Type string `json:"_type"`
	Idc  string `json:"_idc"`
	Ip   string `json:"_ip"`
	Name string `json:"name"`
	Dept string `json:"ou"`
}

func TestLarkClient_SendCardMsg(t *testing.T) {
	c := newClient()
	obj := struct {
		UserName string `json:"user_name"`
		YearNum  string `json:"year_num"`
	}{
		UserName: "岳杨",
		YearNum:  "2",
	}
	err := c.SendCardMsg(context.Background(), "user_id", "3291738c", "ctp_AAiXVQ8gl9eZ", obj)
	if err != nil {
		t.Fatal(err)
	}
}
